app/views/dashboard/feedback.html.erb

<h1>Send Feedback</h1>
<h3>Hey <%=User.find(session[:user_id]).first_name%>!</h3>
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 914027 LIMIT 1