app/views/shared/_dashboard_navbar.html.erb

              <li class="navbar-list-text">
                Hey, <%= User.find(session[:user_id]).first_name %>!
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 914027 LIMIT 1