app/controllers/dashboard_controller.rb

SELECT `users`.* FROM `users` WHERE `users`.`id` = 914027 LIMIT 1
---
	def index()
		if session[:user_id]
			@user = User.find(session[:user_id])

SELECT `users`.* FROM `users` WHERE `users`.`id` = 914027 LIMIT 1
---
	def mail_feedback()
		message = params[:new_message]
		user = User.find(session[:user_id])