app/controllers/mentors_controller.rb

	def show()
		@mentor = Mentor.find(params[:id])
		@mentees = Mentee.where(mentor_id: @mentor.id)
		if Cohort.exists?(@mentor.cohort_id)
---
SELECT `mentors`.* FROM `mentors` WHERE `mentors`.`id` = 214001 LIMIT 1
SELECT `mentees`.* FROM `mentees` WHERE `mentees`.`mentor_id` = 214001
SELECT 1 AS one FROM `cohorts` WHERE `cohorts`.`id` = 16 LIMIT 1
SELECT `cohorts`.* FROM `cohorts` WHERE `cohorts`.`id` = 16 LIMIT 1