app/controllers/users_controller.rb

SELECT `users`.* FROM `users` WHERE `users`.`login` = 'tylerdavis' LIMIT 1
---
  def login()
		user = User.find_by_login(params[:user_login])

SELECT `users`.* FROM `users` WHERE `users`.`id` = 914027 LIMIT 1
---
	def settings()
		@user = User.find(session[:user_id])